VV_cases/V2_thermal/results/study_v2a/runs/006_data_v2_production_like_short/simulations/Re40_prodLike/openfoam_setup/constant/g
FoamFile
{
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 -9.81 0);
