VV_cases/V2_thermal/results/study_v2a/runs/006_data_v2_production_like_short/simulations/Re40_prodLike/openfoam_setup/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

solver          fluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         18.0;
deltaT          1e-4;
adjustTimeStep  yes;
maxCo           0.5;
writeControl    runTime;
writeInterval   0.5;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        executeControl  timeStep;
        writeControl    runTime;
        writeInterval   0.05;
        log             yes;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.2050;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.050539419;
        lRef            0.012;
        Aref            0.000144;
    }

    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p_rgh e);
        executeControl  timeStep;
        writeControl    runTime;
        writeInterval   0.05;
    }
}
